// pages/recommend/outRecommend/outRecommend.ts
Page({

  /**
   * 页面的初始数据
   */
  data: {
    outRecommend:[{name:'如新滢白三效修护霜（暂为非直销品）如新滢白三效修护霜（暂为非直销品如新滢白三效修护霜（暂为非直销品'},{name:'立白洗洁精'},{name:'开心麻花开心麻花开心麻花开心麻花'},{name:'如新滢白三效修护霜（暂为非直销品）测试数据'}]

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad() {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  }
})